#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PHLAT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "PLR Health Service Delivery Site Data Load Assistant Tool"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PHLAT"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://d2llaidph43whp.cloudfront.net/app/*",
          + "https://localhost:*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.keycloak_openid_user_client_role_protocol_mapper.Client-Role-Mapper-PHLAT will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "Client-Role-Mapper-PHLAT" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "PHLAT"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "PHLAT Role Mapper"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "PHLAT Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_ADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REG_ADMIN"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_USER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REG_USER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-phlat"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-phlat"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-phlat"
      + realm_id  = "moh_applications"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*